#### Q1. List any five functions of the pandas library with execution

Five functions of pandas are:
    
- head() and tail() : used to get the records from the first and last respecively.
- dtypes : used to get the data types of the columns.
- columns : used to get all the columns in a dataframe.
- describe() : used to get the five number summary of the data in the dataframe,etc.
- isnull() : used to find the null values inside the dataframe columns

In [93]:
import pandas as pd

## creating series
logging.info("Creating dataframe")
name = pd.Series(["Prakash","Singh","Kumar","Gupta"])
age = pd.Series([21,18,26,24])
location = pd.Series(["Kolkata","Patna","Agra","Delhi"])

## dictionary with key as column names and values as series
data = {"name":name,
       "age":age,
       "location":location}

# creating dataframe
dataframe = pd.DataFrame(data)
dataframe

      name  age location
0  Prakash   21  Kolkata
1    Singh   18    Patna
2    Kumar   26     Agra
3    Gupta   24    Delhi

In [102]:
logging.info("head() function")
print("HEAD FUNCTION:")
print(dataframe.head(1))

logging.info("tail() function")
print("\n \nTAIL FUNCTION:")
print(dataframe.tail(1))

logging.info("coulmn function")
print("\n \nCOLUMNS FUNCTION:")
print(list(dataframe.columns))

logging.info("dtpyes() function")
print("\n\n DTYPES FUNCTION:")
print(list(dataframe.dtypes))

logging.info("isnull() function")
print("\n\nisnull FUNCTION")
print(dataframe.isnull().sum())

logging.info("describe() function")
print("\n\n DESCRIBE() FUNCTION")
dataframe.describe()

HEAD FUNCTION:
      name  age location
0  Prakash   21  Kolkata


TAIL FUNCTION:
    name  age location
3  Gupta   24    Delhi


COLUMNS FUNCTION:
['name', 'age', 'location']


 DTYPES FUNCTION:
[dtype('O'), dtype('int64'), dtype('O')]


isnull FUNCTION
name        0
age         0
location    0
dtype: int64


 DESCRIBE() FUNCTION

         age
count   4.00
mean   22.25
std     3.50
min    18.00
25%    20.25
50%    22.50
75%    24.50
max    26.00

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [18]:
import pandas as pd
df = pd.DataFrame({"A":[1,2,3,4,5],
                   "B":[6,8,9,7,10],
                   "C":[10,20,30,40,50]})
df
## the length of the data frame after incrementing len(df)*2 
df.index = pd.RangeIndex(start = 1,stop = len(df)*2 ,step = 2)
df

   A   B   C
1  1   6  10
3  2   8  20
5  3   9  30
7  4   7  40
9  5  10  50

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 
calculate and print the sum of the first three values, which is 60.

In [118]:
import logging
logging.basicConfig(filename = "test.log", level = logging.INFO,format =' %(asctime)s , %(message)s')

logging.info ("Creating a Database")
values = [10,20,30,40,50,60]
df = pd.DataFrame({"Values":values})

logging.info("This a function to find the sum of first three values in Values column")
def sum_values(df):
    sum_values = 0
    try:
        for i in df["Values"][0:3]:
            sum_values += i
        print( sum_values,"is the sum of first three values in Value column.")
    except KeyError as e:
        logging.error("Key Error {}",format(e))
        

sum_values(df)

60 is the sum of first three values in Value column.

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [240]:
df_text = pd.DataFrame({"Text":["Prakash Singh Kumar","Gupta Kishore","number of words are"]})

In [245]:
## counting the number of words and making a new column word_Count
df_text["Word_count"] = df_text["Text"].apply(lambda x : len(x.split()))
df_text

                  Text  Word_count
0  Prakash Singh Kumar           3
1        Gupta Kishore           2
2  number of words are           4

#### Q5. How are DataFrame.size() and DataFrame.shape() different

DataFrame.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It is equivalent to DataFrame.shape[0] * DataFrame.shape[1

In [108]:
logging.info("size function")
df.size

5

DataFrame.shape, on the other hand, returns a tuple representing the dimensions of the DataFrame in the form (number of rows, number of columns). It provides information about the shape of the DataFrame,

In [105]:
logging.info("shape funtion")
df.shape

5

#### Q6. Which function of pandas do we use to read an excel file?

In Pandas, we can use the read_excel() function to read data from an Excel file. This function reads the data from one or multiple sheets in an Excel file into a Pandas DataFrame.

In [119]:
logging.info ("Importing the lxml module to read excel file")
import lxml

logging.info ("Reading an excel file using pd.read_excel ")
## sheet_name is used to get the data from a specific sheet using the name of the sheet or the oreder of the sheet
df_Excel = pd.read_excel(r"C:\Users\praka\Downloads\global_superstore_2016 (1).xlsx",sheet_name = 1)

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the 
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your 
function should extract the username from each email address and store it in the new 'Username' 
column.

In [86]:
## creaitng a dataframe
Email = ["raj.singh@gmail.com","prakash.singh@gmail.com","kumar.rao@gamil.com","shiv.sah@gmail.com"]
df_Email = pd.DataFrame({"Email":Email})

In [ ]:
## first method

In [87]:
def split(x):
    username = df_Email["Email"].str.split("@").str[0]
    df_Email["Username"] = username
    return df_Email
#df_Email[["Name","gmail"]] = df_Email["Email"].apply(split)
df_Email = split(df_Email)
df_Email

                     Email       Username
0      raj.singh@gmail.com      raj.singh
1  prakash.singh@gmail.com  prakash.singh
2      kumar.rao@gamil.com      kumar.rao
3       shiv.sah@gmail.com       shiv.sah

In [ ]:
## second method

In [99]:
df_Email["Name"]= df_Email["Email"].str.split('@').str[0]
df_Email

                     Email       Username           Name
0      raj.singh@gmail.com      raj.singh      raj.singh
1  prakash.singh@gmail.com  prakash.singh  prakash.singh
2      kumar.rao@gamil.com      kumar.rao      kumar.rao
3       shiv.sah@gmail.com       shiv.sah       shiv.sah

In [101]:
df_Email.drop("Name",axis = 1,inplace = True)

In [103]:
df_Email["First_name"] = df_Email["Username"].str.split(".").str[0]
df_Email["Last_name"] = df_Email["Username"].str.split(".").str[1]

In [106]:
#### Data frame containing the username name , first and last name
df_Email

                     Email       Username First_name Last_name
0      raj.singh@gmail.com      raj.singh        raj     singh
1  prakash.singh@gmail.com  prakash.singh    prakash     singh
2      kumar.rao@gamil.com      kumar.rao      kumar       rao
3       shiv.sah@gmail.com       shiv.sah       shiv       sah

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows

In [117]:
df = pd.DataFrame({"A":[7,8,3,4,5],
                   "B":[6,8,9,7,10],
                   "C":[10,20,30,40,50]})

In [125]:
## condition
selected_rows = df.loc[(df['A']> 5) & (df['B']< 10)]
selected_rows

   A  B   C
0  7  6  10
1  8  8  20

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column

In [134]:
values = [10,20,10,40,50,60]
df = pd.DataFrame({"Values":values})
df.mean()

Values    31.666667
dtype: float64

In [140]:
## function to print the statistical functions
def statistical_ops(x):
    print("MEAN\n\n",x.mean(),"\n\n")
    print("MEDIAN\n\n",x.median(),"\n\n")
    print("MODE\n\n",x.mode(),"\n\n")
    print("STANDARD DEVIATION\n\n",x.std(),"\n\n")
    
statistical_ops(df)

MEAN

 Values    31.666667
dtype: float64


MEDIAN

 Values    30.0
dtype: float64


MODE

    Values
0      10


STANDARD DEVIATION

 Values    21.369761
dtype: float64

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [5]:
import pandas as pd

moving_avg = pd.DataFrame({'Date': pd.date_range(start='2023-01-28', end='2023-02-28'), 
                   'Sales': [10, 12, 8, 6, 11, 9, 13, 14, 16, 18, 20, 22, 21, 19, 17, 
                             15, 13, 11, 9, 8, 7, 6, 5, 8, 10, 12, 14, 16, 18, 20,22,11]})
moving_avg["moving_avg"] = moving_avg.rolling(window = 7,min_periods = 1).mean()
moving_avg

C:\Users\praka\AppData\Local\Temp\ipykernel_10968\3137111788.py:6: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  moving_avg["moving_avg"] = moving_avg.rolling(window = 7,min_periods = 1).mean()

         Date  Sales  moving_avg
0  2023-01-28     10   10.000000
1  2023-01-29     12   11.000000
2  2023-01-30      8   10.000000
3  2023-01-31      6    9.000000
4  2023-02-01     11    9.400000
5  2023-02-02      9    9.333333
6  2023-02-03     13    9.857143
7  2023-02-04     14   10.428571
8  2023-02-05     16   11.000000
9  2023-02-06     18   12.428571
10 2023-02-07     20   14.428571
11 2023-02-08     22   16.000000
12 2023-02-09     21   17.714286
13 2023-02-10     19   18.571429
14 2023-02-11     17   19.000000
15 2023-02-12     15   18.857143
16 2023-02-13     13   18.142857
17 2023-02-14     11   16.857143
18 2023-02-15      9   15.000000
19 2023-02-16      8   13.142857
20 2023-02-17      7   11.428571
21 2023-02-18      6    9.857143
22 2023-02-19      5    8.428571
23 2023-02-20      8    7.714286
24 2023-02-21     10    7.571429
25 2023-02-22     12    8.000000
26 2023-02-23     14    8.857143
27 2023-02-24     16   10.142857
28 2023-02-25     18   11.857143
29 2023-02-26     20   14.000000
30 2023-02-27     22   16.000000
31 2023-02-28     11   16.142857

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column

In [211]:
## creating a dataframe with dates
df = pd.DataFrame({"Date": pd.date_range(start = '2023-02-20' , end = '2023-02-27')})
df["Date"] = pd.to_datetime(df["Date"])

## creating a function
def weekday(x):
        x["weekday"] = x["Date"].dt.day_name()
       # x["weekday"] = weekday
        return x[["Date","weekday"]]

In [212]:
weekday(df)

        Date    weekday
0 2023-02-20     Monday
1 2023-02-21    Tuesday
2 2023-02-22  Wednesday
3 2023-02-23   Thursday
4 2023-02-24     Friday
5 2023-02-25   Saturday
6 2023-02-26     Sunday
7 2023-02-27     Monday

In [213]:
## using dt.day_name() function
df['weekday'] = df["Date"].dt.day_name()
df

        Date    weekday
0 2023-02-20     Monday
1 2023-02-21    Tuesday
2 2023-02-22  Wednesday
3 2023-02-23   Thursday
4 2023-02-24     Friday
5 2023-02-25   Saturday
6 2023-02-26     Sunday
7 2023-02-27     Monday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python  function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [231]:
df_date = pd.DataFrame({"Date": pd.date_range(start = '2022-09-12', end = '2023-02-28')})
df_date.head(5)

        Date
0 2022-09-12
1 2022-09-13
2 2022-09-14
3 2022-09-15
4 2022-09-16

In [228]:
date_Range = df_date.loc[(df_date["Date"] >' 2023-01-01')& (df_date["Date"] < "2023-01-31")]

## starting point
date_Range.head(1)

          Date
112 2023-01-02

In [230]:
## ending point
date_Range.tail(1)

          Date
140 2023-01-30

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported

In order to use the basic funtions of pandas we need to import pandas library.

In [ ]:
## here as is an aliase 
import pandas as pd